In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('V5.csv')
df.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,?,Detached House,3,2,1092.0,1.025953,East

Q1 . Replace all the ? with NAN

In [3]:
count = 0
for index,row in df.iterrows():
    for key,value in row.items():
        if value=='?':
            count += 1
            df.at[index,key] = np.nan

print(count)

1823

In [4]:
df.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,NaN,Detached House,3,2,1092.0,1.025953,East

Q2 . What is the shape of the dataset

In [5]:
df.shape

(10000, 12)

Q3 . What is the value present at the 692th indexed row and 0th indexed column in the data

In [6]:
df.at[692,"Date"]

'2009-11-16'

Q4 . What is the value present at the 546th indexed row and 7th indexed column in the data

In [7]:
df.at[546,"num_rooms"]

3

Q5 . What are the unique values present in the locality feature of the dataset

In [8]:
s = set()
for index,row in df.iterrows():
    s.add(row["Locality"])

print(s)

{'Fairfield', 'Bridgeport', 'Greenwich', 'West Hartford', nan, 'Norwalk', 'Waterbury', 'Stamford'}

Q6 . Which of the following have missing(NaN) values present in the dataset?

In [9]:
s = set()
for index,row in df.iterrows():
    for key,value in row.items():
        if pd.isna(value):
            s.add(key)

print(s)

{'Locality', 'Estimated Value', 'carpet_area', 'Property'}

Q7 . Which of the following has most missing(NaN) values present in the dataset?

In [10]:
from collections import Counter

d = Counter()

for index,row in df.iterrows():
    for key,value in row.items():
        if pd.isna(value):
            d[key] += 1

ans = 0
ans1 = ""
for i in d:
    if d[i]>ans:
        ans = d[i]
        ans1 = i
        
print(ans1)

Property

Q8 . Drop all the samples with missing values strictly greater than 2. How many samples remain after this?

In [14]:
L = []

for index,row in df.iterrows():
    count = 0
    for key,value in row.items():
        if pd.isna(value):
            count += 1
    if count>2:
        L.append(index)
df = df.drop(index=L)
print(df.shape)

(9917, 12)

Q9 . Drop all the samples(rows) with missing values in the orignal dataframe. How many samples remains after that?

In [15]:
L = []
for index,row in df.iterrows():
    count = 0
    for key,value in row.items():
        if pd.isna(value):
            count += 1
    if count:
        L.append(index)
df = df.drop(index=L)
print(df.shape)

(5449, 12)